Repository: robot-xliff-farmer/bem-method
Catalog: bem-method.tmx
Source language: ru
Languages: en

source: { block : 'control-group', content : [ { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Имя' }, { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Фамилия' }, { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Электронный адрес' } ] }
en: { block : 'control-group', content : [ { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Name' }, { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Surname' }, { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Email' } ] }

source: { block : 'control-group', content : [ { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Просмотреть корзину' }, { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'История покупок' }, { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Проверить бонусный счет' } ] }
en: { block : 'control-group', content : [ { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'View Cart' }, { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Create a wish list' }, { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'View your balance' } ] }

source: { block : 'control-group', content : [ { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Введите запрос' }, { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Поиск' } ] }
en: { block : 'control-group', content : [ { block : 'input', mods : { theme : 'islands', size : 'm', type : 'search' }, placeholder : 'Enter your question' }, { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Search' } ] }

source: { block : 'control-group', content : [ { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Цена от' }, { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'до' }, { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'm' }, val: 'usd', options : [ { val : 'usd', text : '$' }, { val : 'euro', text : '€' } ] } ] }
en: { block : 'control-group', content : [ { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'Price from' }, { block : 'input', mods : { theme : 'islands', size : 'm' }, placeholder : 'to' }, { block : 'select', mods : { mode : 'radio', theme : 'islands', size : 'm' }, val: 'usd', options : [ { val : 'usd', text : '$' }, { val : 'euro', text : '€' } ] } ] }

source: dropdown (с модификатором switcher в значении button)
en: dropdown (switcher modifier with button value)

source: { block : 'control-group', content : [ { block : 'button', mods : { view : 'action', theme : 'islands', size : 'm' }, text : 'Купить сейчас!' }, { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : 'Действующие скидки', popup : 'Воспользуйтесь нашим специальным предложением: «50% скидка на доставку каждого пятого груза».' } ] }
en: { block : 'control-group', content : [ { block : 'button', mods : { view : 'action', theme : 'islands', size : 'm' }, text : 'Buy now!' }, { block : 'dropdown', mods : { switcher : 'button', theme : 'islands', size : 'm' }, switcher : 'Sales', popup : 'Take advantage of our special offer: ”50% discount on every fifth cargo delivery».' } ] }

source: checkbox (с модификатором type в значении button)
en: checkbox (type modifier with button value)

source: { block : 'control-group', content : [ { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'tv', val: '1', text : 'Телевизоры' }, { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'photo', val: '1', text : 'Фотокамеры' }, { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'book', val: '1', text : 'Электронные книги' } ] }
en: { block : 'control-group', content : [ { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'tv', val: '1', text : 'TV sets' }, { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'photo', val: '1', text : 'Cameras' }, { block : 'checkbox', mods : { theme : 'islands', size : 'm', type : 'button' }, name: 'book', val: '1', text : 'Electronic books' } ] }

source: Используется для создания различных типов кнопок.
en: Use this block for creating different types of buttons.

source: Тип кнопки.
en: The type of button.

source: Тип переключателя.
en: The toggle button.

source: Действие «нажатие на кнопку».
en: The pressed state.

source: Размер кнопки. Используется для кнопок с модификатором theme в значении islands.
en: The size of the button. Use sizes only for buttons with the theme modifier set to islands.

source: Тип визуального выделения кнопки.
en: Visual highlighting.

source: Уникальное имя блока. Не используется, если модификатор type выставлен в значение link.
en: The unique block name. Do not use when the type modifier is set to link.

source: Значение, отправляемое на сервер. Не используется, если модификатор type выставлен в значение link.
en: The value to send to the server. Do not use when the type modifier is set to link.

source: Текст кнопки.
en: Button lable.

source: Адрес. Используется только для кнопки с модификатором type в значении link.
en: Link address. Use only when the type modifier is set to link.

source: Иконка на кнопке. Формируется блоком icon.
en: Button icon. It iscreated by the icon block.

source: Текст всплывающей подсказки.
en: Tooltip content.

source: Уникальный идентификатор кнопки.
en: The button unique identifier.

source: Блок button предоставляет возможность изменять размер, состояние, содержимое и внешний вид кнопок.
en: Use the button block to control the size, state, and appearance of the button.

source: Допустимые значения: 'link', 'submit'.
en: Acceptable values: 'link', 'submit'.

source: Кнопка-ссылка (модификатор type в значении link)
en: Link-button (type modifier with link value)

source: Используется для создания кнопки, обеспечивающей переход по адресу, указанному в поле url.
en: Use to create a button to jump to the address specified in the url field.

source: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'link' }, url : 'https://bem.info/', text : 'Попробуй БЭМ' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'link' }, url : 'https://bem.info/', text : 'Try BEM!' }

source: Кнопка отправки формы (модификатор type в значении submit)
en: Form submit button (type modifier with submitvalue)

source: Используется для создания кнопки, обеспечивающей отправку данных на сервер. Кнопка такого типа всегда должна располагаться в форме.
en: Use the modifier with the value for creating the button to send data to the server. This button type must be a part of a form.

source: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, text : 'Я отправляю данные' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, text : 'Send data' }

source: Модификатор togglable
en: Modifiertogglable

source: Допустимые значения: 'check', 'radio'.
en: Acceptable values: 'check', 'radio'.

source: Используется для реализации «залипания» кнопки. Определяет поведение нажатой кнопки.
en: Defines behavior of the pressed button.

source: Кнопка-переключатель (модификатор togglable в значении check)
en: Toggle button (togglable modifier with check value)

source: Первое нажатие на кнопку вдавливает ее, второе – приводит в первоначальное состояние.
en: The first click presses the button, and the second one releases it.

source: { block : 'button', mods : { theme : 'islands', size : 'm', togglable : 'check' }, text : 'Я нажата' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', togglable : 'check' }, text : 'I am pressed' }

source: Радиокнопка (модификатор togglable в значении radio)
en: Radio-button (togglable modifier with radio value)

source: Нажатие на кнопку вдавливает ее, и она может быть приведена в первоначальное состояние только программно. Используется в составе радиогруппы.
en: The first click presses the button, and it cannot be released manually. This button type is used as a part of a radio-group.

source: { block : 'button', mods : { theme : 'islands', size : 'm', togglable : 'radio' }, text : 'Я «залипла» :)' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', togglable : 'radio' }, text : 'I am toggled :)' }

source: Пример использования в радиогруппе:
en: An example of the button usage as a part of the radio-group:

source: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button', togglable : 'radio' }, name : 'radio-button', options : [ { val : 1, text : 'Первый' }, { val : 2, text : 'Второй', checked : true }, { val : 3, text : 'Третий' } ] }
en: { block : 'radio-group', mods : { theme : 'islands', size : 'm', type : 'button', togglable : 'radio' }, name : 'radio-button', options : [ { val : 1, text : 'First' }, { val : 2, text : 'Second', checked : true }, { val : 3, text : 'Third' } ] }

source: { block : 'button', mods : { theme : 'islands', size : 'm', disabled : true }, text : 'Неактивна' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', disabled : true }, text : 'Disabled' }

source: Выставляется автоматически при получении кнопки фокуса.
en: The modifier is added to the button automatically at the moment when the button is pressed.

source: Модификатор pressed
en: Modifierpressed

source: Определяет действие «нажатие на кнопку».
en: Defines the "press the button" action.

source: Выставляется автоматически при нажатии на кнопку.
en: The modifier is added to the block automatically at the moment when the button is pressed.

source: Выставляется блоку автоматически, когда курсор мыши находится в пределах контрола, но щелчка по нему не происходит.
en: The modifier is added to the block automatically at the moment when you mouse over it.

source: { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Тема islands' }
en: { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Islands theme' }

source: Задает размер всем типам кнопок.
en: Sets the size value for all types of buttons.

source: { block : 'button', mods : { theme : 'islands', size : 's' }, text : 'Размер s' }
en: { block : 'button', mods : { theme : 'islands', size : 's' }, text : 'Size s' }

source: { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Размер m' }
en: { block : 'button', mods : { theme : 'islands', size : 'm' }, text : 'Size m' }

source: { block : 'button', mods : { theme : 'islands', size : 'l' }, text : 'Размер l' }
en: { block : 'button', mods : { theme : 'islands', size : 'l' }, text : 'Size l' }

source: { block : 'button', mods : { theme : 'islands', size : 'xl' }, text : 'Размер xl' }
en: { block : 'button', mods : { theme : 'islands', size : 'xl' }, text : 'Size xl' }

source: Модификатор view
en: Modifierview

source: Допустимые значения: 'action', 'pseudo', 'plain'.
en: Possible values: 'action', 'pseudo', 'plain'.

source: Кнопка действия (модификатор view в значении action)
en: Action button (view modifier with action value)

source: Используется для визуального выделения кнопки на странице.
en: The modifier visually highlights the button on a page. For example, use it to create a promo button:

source: { block : 'button', mods : { theme : 'islands', size : 'm', view : 'action' }, text : 'Купить сейчас!' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', view : 'action' }, text : 'Buy now!' }

source: Псевдокнопка (модификатор view в значении pseudo)
en: Pseudobutton (view modifier with pseudo value)

source: Используется для изменения внешнего вида блока при необходимости сделать кнопку менее заметной на странице.
en: The modifier changes visual representation of the button. For example, use it if you do not need to focus attention on the button:

source: { block : 'button', mods : { theme : 'islands', size : 'm', view : 'pseudo' }, text : 'У меня прозрачный фон' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', view : 'pseudo' }, text : 'With transparent background' }

source: { block : 'button', mods : { theme : 'islands', size : 'm', view : 'pseudo', disabled : true }, text : 'У меня нет границ' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', view : 'pseudo', disabled : true }, text : 'Without borders' }

source: Кнопка без границ (модификатор view в значении plain)
en: A button without borders (the view modifier with the plain value)

source: Используется при необходимости представить кнопкой другой блок, например, иконку (icon).
en: Use to represent some other block as a button, e.g. icon.

source: { block : 'button', mods : { theme : 'islands', size : 'm', view : 'plain' }, text : 'Кнопка без границ' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', view : 'plain' }, text : 'A button without borders' }

source: Не используется, если модификатор type выставлен в значение link.
en: Do not use the field when type modifier is set to link.

source: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, name : 'Test_1', val : 'passed', text : 'Проверить результат' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, name : 'Test_1', val : 'passed', text : 'Check results' }

source: Тип данных: String, Number.
en: Type: String, Number.

source: Определяет значение кнопки, которое будет отправлено на сервер.
en: Specifies the value to send to the server.

source: Определяет текст, который отображается на кнопке.
en: Specifies the button lable.

source: Определяет адрес, по которому осуществляется переход при нажатии на кнопку с модификатором type в значении link.
en: Specifies the link address that will be opened by clicking the link-button.

source: Не используется с другими типами кнопок.
en: Use the field for link-buttons only.

source: Определяет иконку, которая отображается на кнопке. Иконка задается с помощью блока icon.
en: Specifies the icon on the button. Declare the icon using the icon block.

source: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, name : 'Тест №1', val : 'Пройден успешно', text : 'Проверить результат', title : 'Кнопка отправки результатов теста' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, name : 'Test #1', val : 'Passed', text : 'Check the result', title : 'This button shows the test results' }

source: Определяет уникальный идентификатор кнопки.
en: Specifies the unique identifier of the button.

source: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, name : 'Тест №1', val : 'Пройден успешно', text : 'Проверить результат', id : 'Unique_1' }
en: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, name : 'Test #1', val : 'Passed', text : 'Check the result', id : 'Unique_1' }

source: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, name : 'Тест №1', val : 'Пройден успешно', text : 'Проверить результат', id :'val_1', tabIndex : 2 }
en: { block : 'button', mods : { theme : 'islands', size : 'm', type : 'submit' }, name : 'Test #1', val : 'Passed', text : 'Check the result', id :'val_1', tabIndex : 2 }

source: Используется для создания блоков, открывающихся поверх остальных слоев страницы.
en: Use this block for creating some blocks that are displayed above all other elements on a page.

source: Точка открытия всплывающего окна.
en: The target point of the popup.

source: Видимость всплывающего окна.
en: Displaying of the popup.

source: Автоматическое скрытие всплывающего окна.
en: Autoclosing of the popup.

source: Расположение (в порядке приоритета) относительно точки открытия. Используется только для всплывающих окон с модификатором target.
en: Popup position (in priority order) depending on the target point. Use only for popups with the target modifier.

source: Смещение в пикселях всплывающего окна относительно основного направления. Используется только с модификатором target.
en: Popup offset (in pixels) along the main direction. Use only for popups with the target modifier.

source: Смещение в пикселях всплывающего окна относительно второстепенного направления. Используется только с модификатором target.
en: Popup offset (in pixels) along the secondary direction. Use only for popups with the target modifier.

source: Минимально допустимое смещение в пикселях всплывающего окна от края окна браузера. Используется только с модификатором target.
en: The minimum popup offset (in pixels) from a viewport border. Use only for popups with the target modifier.

source: Уровень слоя для открывающихся всплывающих окон. Использует блок z-index-group.
en: The level of the popup layer based on the z-index-group block.

source: Блок popup используется для создания всплывающих окон поверх остальных слоев страницы. Позволяет изменять их состояние, поведение и внешний вид.
en: Use the popup block to control the state, behavior and appearance of the popups that are always displayed above all other elements on a page.

source: Модификатор target
en: Modifiertarget

source: Допустимые значения: 'anchor', 'position'.
en: Acceptable values:: 'anchor', 'position'.

source: Модификатор target определяет точку открытия всплывающего окна.
en: Use the target mоdifier to set the target point of the popup.

source: Якорь (модификатор target в значении anchor)
en: Anchor target modifier with anchor value)

source: Позволяет использовать в качестве точки открытия всплывающего окна блок или элемент.
en: Use to set a block or an elements as the target point of the popup.

source: Поддерживается многоуровневая вложенность всплывающих окон (из каждого открытого блока popup может быть вызван другой). Одновременно с закрытием всплывающего окна закрываются все его дочерние окна.
en: The popup block supports a nested structure of multiple simultaneous popups. It means that it is possible to open a child popup within a parent one. When the parent popup closes, it hides all its childs popups.

source: Необходимо использовать метод setAnchor.
en: Use the setAnchor method for correct work of the block.

source: Координаты (модификатор target в значении position)
en: Position coordinates (target modifier with position value)

source: Позволяет задавать точку открытия всплывающего окна координатами.
en: The modifier allows to set the position coordinates as the target point of the popup.

source: Необходимо использовать метод setPosition.
en: Use the setPosition method for correct work of the block.

source: Модификатор visible
en: visible modifier

source: Способы использования: JS.
en: Use cases: JS.

source: Выставляется при открытии всплывающего окна.
en: The modifier is set automatically when the popup is displayed.

source: Отвечает за видимость всплывающего окна на странице.
en: Defines visibility of the popup window.

source: Модификатор autoclosable
en: autoclosable modifier

source: При наличии модификатора autoclosable блок скрывается по клику вне зоны всплывающего окна или по нажатию кнопки Escape.
en: The modifier with the autoclosable value allows to hide the popup automatically by clicking outside the popup area or pressing Escape button.

source: { block : 'popup', mods : { theme : 'islands', autoclosable : true }, content : 'Содержимое всплывающего окна' }
en: { block : 'popup', mods : { theme : 'islands', autoclosable : true }, content : 'Content of the popup' }

source: { block : 'popup', mods : { theme : 'islands' }, content : 'Содержимое всплывающего окна' }
en: { block : 'popup', mods : { theme : 'islands' }, content : 'Content of the popup' }

source: Поле directions
en: directions field

source: Определяет расположение всплывающего окна относительно точки открытия.
en: Specifies the popup position (in the priority order) depending on the target point.

source: Используется только для всплывающих окон с модификатором target.
en: Use only for popups with the target modifier.

source: Расположение блока определяется автоматически, исходя из массива допустимых направлений (в порядке приоритета) и положения точки открытия на странице. У всех допустимых направлений есть основной и второстепенный параметры. Например, для направления bottom-left параметр bottom является основным, а left — второстепенным.
en: The popup position is set automatically based on the acceptable directions list and the target point position. The acceptable positions have main and secondary parameters: for example, for the bottom-left direction the main parameter is bottom, and the secondary one is left.

source: По умолчанию используется следующий массив допустимых направлений:
en: By default the following admissible directions are available:

source: Для управления расположением всплывающего окна необходимо указать массив направлений открытия. При этом из значений массива будет выбрано наиболее подходящее, исходя из положения точки открытия на странице.
en: To set the popup position, an array of possible directions must be declared in BEMJSON. The most suitable direction will be selected automatically depending on the target point position on a page.

source: Например, если требуется, чтобы всплывающее окно раскрывалось над точкой открытия:
en: For example, to open the popup at the target point.

source: { block : 'popup', mods : { autoclosable : true, theme: 'islands', target : 'anchor' }, directions : ['top-left', 'top-center', 'top-right'], content : 'Содержимое всплывающего окна' }
en: { block : 'popup', mods : { autoclosable : true, theme: 'islands', target : 'anchor' }, directions : ['top-left', 'top-center', 'top-right'], content : 'Content of the popup' }

source: Если необходимо разместить всплывающее окно справа по центру:
en: An example of the right-center position:

source: { block : 'popup', mods : { autoclosable : true, theme: 'islands', target : 'anchor' }, directions : ['right-center'], content : 'Содержимое всплывающего окна' }
en: { block : 'popup', mods : { autoclosable : true, theme: 'islands', target : 'anchor' }, directions : ['right-center'], content : 'Content of the popup' }

source: Поле mainOffset
en: mainOffset field

source: Определяет смещение в пикселях всплывающего окна относительно основного направления.
en: Specifies the popup offset (in pixels) along the main direction.

source: Используется только с модификатором target.
en: Use only for popups with the target modifier.

source: { block : 'popup', mods : { theme: 'islands', target : 'anchor' }, directions : ['right-center'], content : 'Содержимое всплывающего окна', mainOffset : 100 }
en: { block : 'popup', mods : { theme: 'islands', target : 'anchor' }, directions : ['right-center'], content : 'Content of the popup', mainOffset : 100 }

source: Поле secondaryOffset
en: secondaryOffset field

source: Определяет смещение в пикселях всплывающего окна относительно второстепенного направления.
en: Specifies the popup offset (in pixels) along the secondary direction.

source: { block : 'popup', mods : { theme: 'islands', target : 'anchor' }, directions : ['right-center'], content : 'Содержимое всплывающего окна', secondaryOffset : 100 }
en: { block : 'popup', mods : { theme: 'islands', target : 'anchor' }, directions : ['right-center'], content : 'Content of the popup', secondaryOffset : 100 }

source: Поле viewportOffset
en: viewportOffset field

source: Определяет минимально допустимое смещение в пикселях всплывающего окна от края окна браузера.
en: Specifies the minimum popup offset (in pixels) from a viewport border.
